%exm050208 

clear							% 
x=1978:2016;
yL=[3645,4062,4545,4892,5323,5962,7208,9016,10275,12058,15042,...
	16992,18667,21781,26923,35333,48197,60973,71176,78973,84402,...
	89677,99214,109655,120332,135822,159878,184937,216314,...
	265810,314045,340903,410202,472882,519322,568845,636463,...
	676708,744127];			%
yR=[343,387,477,491,526,564,651,739,899,1002,1181,1373,1510,1700,...
	2026,2577,3496,4283,4838,5160,5425,5854,6280,6860,7702,8472,...
	9421,10493,11759,13786,15781,17175,19109,21810,24565,26955,...
	28844,31195,33616];		%   

close all								% 		<12>
figure									% 
yyaxis left							% 					<14>
plot(x,yL*1e-4,'LineWidth',3)		% 		<15>
ylim([0,80])							% 					<16>
ylabel('全国GDP（万亿元）')			% 
yyaxis right							% 					<18>
plot(x,yR*1e-4)						% 	<19>
ylim([0,3.5])							% <20>
ylabel('全国城镇居民年人均可支配收入（万元）')% 
grid on								% 				<22>
xlabel('年')
title('1978~2016年全国GDP和城镇居民人均可支配收入')
										% 
legend('GDP','可支配收入','Location','NorthWest')				%	<26> 

figure									% 						<27>
Ax=gca;								% 
yyaxis left										% 			<29>
Lc='b';											% 
plot(x,yL*1e-4,'Color',Lc,'LineWidth',3);	% 	<31>
Ax.YColor=Lc;										% 		<32>
ylabel('全国GDP（万亿元）','Color',Lc);		% 		<33>
ylim([0,80]);										% 			<34>
yyaxis right								% 					<35>
Rc='r';									% 
bar(x,yR*1e-4,'FaceColor',Rc,'FaceAlpha',0.4,'EdgeColor',Rc,...
	'EdgeAlpha',0.4)						% 		<38>
Ax.YColor=Rc;								% 			<39>
ylabel('全国城镇居民年人均可支配收入（万元）','Color',Rc)			%	<40>
											% 
ylim([0,3.5]);							% 					<42>
xlabel('年')							% 
grid('minor')							% 				<44>
title('1978~2016年全国GDP和城镇居民人均可支配收入')	% 
legend('GDP','可支配收入','Location','NorthWest')				%	<46>  


