%exm050101 

T=(1950:5:2015)';					% 
CN=[61;285;1351;1223;1779;2390;3712;4679;6635;9536;...
	12850;34940;63874;80380]/1000;% 
US=[8785;10617;9007;11926;11931;10582;10146;8006;8972;9359;...
	10182;9490;8050;7880]/1000;	% 

figure									% 						<6>
plot(T,CN,'r.','MarkerSize',20);	% 		<7>
hold on								% 
Hus=plot(T,US,'bo');				% 	<9>
Hus.MarkerSize=8;					% 			<10>
hold off								% 				<11>
legend('中国','美国','Location','NorthWest')		% 
grid on								% 						<13>
Ax=gca;								% 		<14>
set(Ax,'XTick',1950:5:2015,'XTickLabelRotation',-45)			%	<15>
								% 
xlabel('年'),ylabel('千万吨')		% 				<17>
title('1950~2015年间中美两国年钢产量数据的变化')	% 		<18>















